[{"id":1,"description":"Build complete Pace running app landing page based on campaign brief at /home/user/Attachments/729dfedd-e248-42ac-bc4a-716fd1e2254c.json. Create fullscreen hero section with video background (4m8wxuq0li.mp4 transitioning to h46y3g4zo3.mp4), headline 'Improve your Pace', subheadline about chaos (Strava screenshots, Excel plans, race sites everywhere), body text 'Everything for running in one app', and 'Join waitlist' CTA button linking to form section. Use colors primary #007AFF, secondary #4B6FFF, bg #F6F8FF. Fonts: Montserrat Semibold for headlines, Inter for body. Nike premium aesthetic with clean modern interface.","type":"feature","passes":true},{"id":2,"description":"Create Why Pace section with calm video background (qs44lu51b6.mp4 - liquid glass animation). Headline 'Why Pace exists'. Body text explains the problem: posting runs to Strava for history but it doesn't answer 'What should I do next?'. Strava is a great log but isn't adaptive. Races saved from random websites, plans in spreadsheets, coaches get screenshots in chat. Pace fixes this by putting adaptive plans, races and coaches into one app. Text overlaid on the calm video background.","type":"feature","passes":true},{"id":3,"description":"Create Solution section with 2-column layout combining text and video. Headline 'Improve your Pace. And your pace.' Three features displayed: 1) Adaptive Plans (video 2nqkbf2npz.mp4) - 'Missed a week? Classic plans ignore it. Pace rebuilds your week around real life.' 2) Race Calendar (video 5ek2ofn3m5.mp4) - 'One place for all races. No more searching on random websites.' 3) Coach Platform (video nolgvg0yag.mp4) - 'Coach sees everything in Pace. No screenshots needed. Coach sets training week directly in app.' Include 'See how it works' CTA linking to form.","type":"feature","passes":true},{"id":4,"description":"Create MVP section with centered card layout and video background (2nqkbf2npz.mp4). Headline 'We start simple'. Body text: 'Pace is early in development. The vision is one home for plans, races and coaches in a single app. The first step: adaptive plans that understand when life happens.' Note at bottom: 'Early testers shape the full running home.'","type":"feature","passes":true},{"id":5,"description":"Create final CTA section with full card and form, video background (nolgvg0yag.mp4). Headline 'Start your Pace journey'. Body: 'Join waitlist to test adaptive plans v0.1. Help build the running app you want. Team builders welcome.' Form with email (required) and WhatsApp (optional) fields. Consent text: 'Early access updates about Pace.' Submit button labeled 'Join waitlist'. Form should have clean, premium styling matching the brand.","type":"feature","passes":true},{"id":6,"description":"Apply cinematic Nike-style premium design throughout: high contrast, slightly desaturated color grade with cool tones and subtle blue accents. Use golden hour outdoor light aesthetic, stadium lights at night feel, city dusk skyline vibes. Ensure all videos autoplay, loop seamlessly, and are muted. Smooth scrolling experience. Mobile responsive. Clean, minimal, premium feel. All CTAs should be prominent and use the primary blue color.","type":"feature","passes":true},{"id":1,"description":"Fix Why Pace section overlay - it's too bright and washing out the liquid-glass video background. Reduce the overlay opacity significantly to let the video show through more. The gradient overlay should be much more subtle.","type":"bug","passes":true},{"id":2,"description":"Replace the first hero video with the user's custom video at ./user-video.mov. This should be the video that plays first before transitioning to the second video. Keep all the same transitions and timing.","type":"feature","passes":true},{"id":1,"description":"Replace the second hero video (the one that plays after the first video ends) with ./user-video-2.mp4. This is the video in the 'Improve your Pace' hero section that currently shows chaotic screens. Keep the same transition behavior from first video to this second video.","type":"feature","passes":true},{"id":1,"description":"Apply glassmorphism effect to the 'Why Pace exists' section. Wrap the content in a container with backdrop-filter blur, semi-transparent background, thin white/gray border (border: 1px solid rgba(255, 255, 255, 0.2)), rounded corners (border-radius: 16-20px), and proper padding. The goal is to create a liquid-glass effect similar to the 'We start simple' section, where the blurred background provides contrast for the text while still showing the video behind it. Remove the current dark overlay and replace with this glassmorphism approach.","type":"feature","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 110: Change the color CSS property from rgb(255, 255, 255) to #4b9fff","type":"feature","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 125: Change color from rgb(75, 159, 255) to #fdfdfc. At src/web/pages/index.tsx line 126: Change color from rgb(253, 253, 252) to #4b9fff","type":"feature","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 125: Change the color CSS property from rgb(75, 159, 255) to #fdfdfc","type":"feature","passes":true},{"id":2,"description":"At src/web/pages/index.tsx line 126: Change the color CSS property from rgb(253, 253, 252) to #4b9fff","type":"feature","passes":true},{"id":1,"description":"Replace the first hero video (the one that plays initially in the hero section) with ./user-video-3.mp4. This is the video that shows first before transitioning to the second video. Keep all transitions and timing the same.","type":"feature","passes":true},{"id":1,"description":"Simplify the hero section to use only one video (./user-video-3.mp4) that loops continuously. Remove the second video and all transition logic between videos. Just one video that autoplays, loops, and is muted - no transitions between different videos.","type":"feature","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 90: Change color from oklab(0.999994 0.0000455678 0.0000200868 / 0.9) to #343232. At src/web/pages/index.tsx line 94: Change color from rgb(253, 253, 252) to #343232. At src/web/pages/index.tsx line 97: Change color from oklab(0.999994 0.0000455678 0.0000200868 / 0.9) to #343232","type":"feature","passes":true},{"id":1,"description":"Add multi-language support with a glassmorphic language switcher in the top-right corner. Switcher displays two flag emojis (🇧🇷 PT-BR and 🇬🇧 EN) in a frosted glass container with backdrop-blur, semi-transparent background rgba(255, 255, 255, 0.1), 1px solid white border at 0.3 opacity, 20px border radius, subtle shadow, 10px padding, 8px gap between flags. Each flag button is 44px, 24px font size, 12px border radius. Inactive state: rgba(255, 255, 255, 0.05) background, 0.6 opacity. Active/hover state: rgba(0, 128, 255, 0.4) background, scale 1.05, 1px solid #0080FF border. Smooth 300ms transitions. Position fixed/sticky top-right.","type":"feature","passes":true},{"id":2,"description":"Implement language switching functionality: detect browser language on first visit (default to EN if not PT-BR), save language choice to localStorage with key 'paceLanguage', load saved preference on revisit. All text content updates instantly when language is changed with smooth fade animation (300-500ms). No page reload. Make keyboard accessible (Tab/Enter navigation) with proper ARIA labels. Ensure responsive on mobile/tablet/desktop.","type":"feature","passes":true},{"id":3,"description":"Add complete translations for EN and PT-BR. ENGLISH: Hero Title 'Improve your Pace', Hero Subtitle 'We know this chaos: Strava screenshots, Excel plans, race sites everywhere.', Description 'Everything for running in one app.', CTA 'Join waitlist', Section Title 'Why Pace exists', Body 'Today you post every run to Strava to keep a history and check how friends train, but Strava doesn't answer the question: What should I do next after this run?', Additional 'It's a great log, but it isn't adaptive.', More 'Your races are saved from random websites, your plan sits in a spreadsheet, and your coach gets screenshots in chat.', Solution 'Pace is an early product that wants to fix this by putting adaptive plans, races and coaches into one app, so your running doesn't feel scattered across five tools.'","type":"feature","passes":true},{"id":4,"description":"Add PT-BR translations: Hero Title 'Melhore seu Pace', Hero Subtitle 'Sabemos desse caos: screenshots do Strava, planos no Excel, sites de corrida por toda parte.', Description 'Tudo para correr em um único app.', CTA 'Junte-se à lista de espera', Section Title 'Por que Pace existe', Body 'Hoje você publica cada corrida no Strava para manter um histórico e verificar como amigos treinam, mas o Strava não responde a pergunta: O que devo fazer após essa corrida?', Additional 'É um ótimo registro, mas não é adaptativo.', More 'Suas provas são salvas em sites aleatórios, seu plano fica em uma planilha e seu treinador recebe screenshots no chat.', Solution 'Pace é um produto em desenvolvimento que quer corrigir isso colocando planos adaptativos, provas e treinadores em um único app, para que seu treino não se sinta espalhado em cinco ferramentas.'","type":"feature","passes":true},{"id":1,"description":"Ensure ALL videos across the entire website are properly muted. Check every video element and add muted attribute. Verify that user-video-3.mp4 in hero section, qs44lu51b6.mp4 in Why Pace section, 2nqkbf2npz.mp4 in MVP section, and nolgvg0yag.mp4 in CTA section all have the muted attribute set. Also ensure no audio is playing from any source on the page.","type":"bug","passes":true},{"id":1,"description":"Adapt all background videos for mobile devices. Ensure proper object-fit (cover), object-position (center), and aspect ratio handling on mobile screens. Videos should fill the viewport correctly on all screen sizes without distortion or black bars. Apply mobile-specific CSS if needed (e.g., different object-position for portrait vs landscape). Test that hero video, Why Pace video, MVP video, and CTA video all display properly on mobile, tablet, and desktop with smooth responsive behavior.","type":"feature","passes":true},{"id":1,"description":"Fix mobile video display to fill vertical screens (9:16 format) without black bars. On mobile devices (max-width: 768px or portrait orientation), videos should zoom in and crop to fill the vertical screen completely. Use CSS media queries to apply mobile-specific styling: on portrait mobile, set video height to cover full viewport height, width to auto or wider than viewport, and use object-fit: cover with object-position: center. The video should be cropped horizontally but fill the entire vertical space, eliminating black bars on sides. Apply to all background videos (hero, Why Pace, MVP, CTA sections).","type":"feature","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 255: Change color from rgb(75, 159, 255) to #343232","type":"feature","passes":true},{"id":1,"description":"In the 'Start your Pace journey' CTA section, change the body text from 'Join waitlist to test adaptive plans v0.1. Help build the running app you want. Team builders welcome.' to 'Join waitlist to test app or Help us build the running app you wish you had.'","type":"feature","passes":true},{"id":2,"description":"Add a checkbox below the WhatsApp field (before the consent text) with the label 'I'd like to join the team'. When checked, open a clean minimal modal window that matches the glassmorphism aesthetic. The modal should contain: a single text input field with placeholder 'i can help with..', a close button, and a submit/confirm button. The field is optional. If filled, save this information together with the user's waitlist signup data. Style the modal with backdrop-blur, semi-transparent background, rounded corners, and proper spacing matching the site's premium design.","type":"feature","passes":true},{"id":1,"description":"Remove the modal window approach. Instead, when the 'I'd like to join the team' checkbox is checked, smoothly slide down/expand a text input field directly below the checkbox label. The input field should have the same styling as the email and WhatsApp fields (same border, background, padding, rounded corners, text color, placeholder style). Use smooth CSS transition/animation for the slide-down effect. When unchecked, the field smoothly collapses/hides. The field should have placeholder 'i can help with..' and save with the form submission when filled.","type":"feature","passes":true},{"id":1,"description":"Fix video positioning issue on desktop/web version. Currently the video is shifted down below the 'Join waitlist' button on desktop, which is incorrect. The mobile-specific CSS rules are affecting desktop layout. Update the CSS media queries to apply mobile video styles (zoomed-in vertical fill) ONLY on mobile/portrait devices (max-width: 768px or portrait orientation). On desktop/landscape devices (min-width: 769px), videos should remain centered with standard object-fit: cover and position: absolute with inset-0, no transform shifts. Ensure hero video stays properly positioned behind the content on all screen sizes.","type":"bug","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 442: Change text content from 'Join waitlist to test app or Help us build the running app you wish you had.' to 'Join waitlist to test app or help us to build the running app you'd wish to have'","type":"feature","passes":true},{"id":1,"description":"Ensure the video nolgvg0yag.mp4 in the CTA section is completely muted. Verify the muted attribute is set on the video element. Also add volume={0} if using React video props. This video should have no audio playing whatsoever.","type":"bug","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 443: Change text content from 'Join waitlist to test app or help us to build the running app you'd wish to have' to 'Join waitlist to test app and help us to build the running app you'd wish to have'","type":"feature","passes":true},{"id":1,"description":"Replace the hero section video with ./user-video-4.mp4. This is the main video on the first screen that currently uses user-video-3.mp4. Keep all video attributes the same (autoplay, muted, loop, playsInline).","type":"feature","passes":true},{"id":1,"description":"Remove the Race Calendar feature from the Solution section entirely. The features array should only include Adaptive Plans (using 2nqkbf2npz.mp4) and Coach Platform (using nolgvg0yag.mp4). Remove the Race Calendar entry that references 5ek2ofn3m5.mp4 since we need to keep total video size under 25MB for deployment.","type":"feature","passes":true},{"id":1,"description":"Restore the Race Calendar feature to the Solution section. Add it back to the features array between Adaptive Plans and Coach Platform. Use video 5ek2ofn3m5.mp4 for the Race Calendar. Update the subtitle from 'Two ways' back to 'Three ways Pace brings your running together' in both English and Portuguese translations.","type":"feature","passes":true},{"id":1,"description":"Add research study section to the MVP 'We start simple' block. After the text 'The first step: adaptive plans that understand when life happens.' add new paragraph: 'We want to build the best running home, so we are running a short research study. Your experience as a runner can directly shape how Pace works for everyone. Take a quick survey to share your story:'. Below add two buttons side by side: 'Take the survey in English' linking to https://tally.so/r/OD1XrM and 'Responder em Português' linking to https://tally.so/r/wMkrKY. Buttons should have same styling as other CTAs with glassmorphism effect.","type":"feature","passes":true},{"id":2,"description":"Add Portuguese translation for the research study text: 'Queremos criar a melhor casa para corredores, por isso estamos fazendo uma pesquisa rápida. A sua experiência de corrida pode influenciar diretamente como o Pace funciona para todo mundo. Responda a um questionário curto e conte a sua história:'. Button labels in PT: 'Questionário' and 'Survey'. Important: When site is in English, show English text with button 'Take the survey in English' linking to English survey. When site is in Portuguese, show Portuguese text with button 'Questionário' linking to Portuguese survey. The secondary button should always show the opposite language option.","type":"feature","passes":true},{"id":1,"description":"Update the 'Join waitlist' button on the hero section (first screen) to match the glassmorphism style used for the survey buttons in the 'We start simple' section. Apply the same styling: backdrop-blur, semi-transparent background with rgba(255, 255, 255, 0.1), border with rgba(255, 255, 255, 0.3), same hover effects, and overall premium glassmorphism aesthetic. Keep the same size and positioning, just update the visual style to match.","type":"feature","passes":true},{"id":1,"description":"Update the MVP survey section to show only ONE button based on the current language. If site is in English, show only 'Take the survey' button linking to https://tally.so/r/OD1XrM. If site is in Portuguese, show only 'Questionário' button linking to https://tally.so/r/wMkrKY. Remove the secondary button for the opposite language. Center the single button.","type":"feature","passes":true},{"id":1,"description":"Update the 'See how it works' button in the 'Improve your Pace. And your pace.' section to match the glassmorphism style of the hero 'Join waitlist' button. Apply backdrop-blur-md, semi-transparent bg-white/10, border border-white/30, and hover effects with hover:border-[#007AFF]/50 hover:bg-[#007AFF]/30. Keep the same size and positioning.","type":"feature","passes":true},{"id":2,"description":"Update the 'Join waitlist' submit button in the 'Start your Pace journey' CTA/form section to match the glassmorphism style of the hero 'Join waitlist' button. Apply backdrop-blur-md, semi-transparent bg-white/10, border border-white/30, and hover effects with hover:border-[#007AFF]/50 hover:bg-[#007AFF]/30. Keep the form button styling functional.","type":"feature","passes":true},{"id":1,"description":"Add the shimmer/shine animation effect to all buttons (survey buttons in MVP section, 'See how it works' button, hero 'Join waitlist'). This is the same animation that exists on the form 'Join waitlist' button - a gradient overlay that slides from left to right on hover. Add overflow-hidden, relative positioning, and an absolute positioned div with gradient (from-transparent via-white/20 to-transparent) that translates from -translate-x-full to translate-x-full with transition-transform duration-500 on group-hover. Apply group class to button.","type":"feature","passes":true},{"id":2,"description":"Make the 'See how it works' button more visible on the light background. Change it from outline style (transparent bg with border) to a more prominent glassmorphism style. Use bg-white/20 or bg-[#007AFF]/20 with backdrop-blur to make it stand out better while maintaining the premium glass aesthetic. Keep the border and hover effects, but increase the base background opacity so it's clearly visible against the light blue background.","type":"feature","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 390: Change the MVP body text from 'Pace is early in development. The vision is one home for plans, races and coaches in a single app. The first step: adaptive plans that understand when life happens.' to 'Pace is early in development. The goal is to have a single app that has space for plans, races, and coaches. Making plans that can change based on what happens in life is the first step.'","type":"feature","passes":true},{"id":1,"description":"At src/web/pages/index.tsx line 411: Change color from oklab(0.999994 0.0000455677 0.0000200868 / 0.6) to #007aff. At src/web/pages/index.tsx line 395: Change color from rgb(0, 122, 255) to #FFFFFFCC","type":"feature","passes":true},{"id":2,"description":"At src/web/pages/index.tsx line 397: Change text from 'We want to build the best running home, so we are running a short research study. Your experience as a runner can directly shape how Pace works for everyone. Take a quick survey to share your story:' to 'Your experience as a runner can help us create the best running app. Take a quick survey to share your story'. At src/web/pages/index.tsx line 411: Change text from 'Early testers shape the full running home.' to 'If you organize races and we'd love to talk and to appear events in future app.'","type":"feature","passes":true}]